# User
user.error.listing=Ocorreu um erro ao listar os usu\u00E1rios!
user.name.not.found=Usu\u00E1rio e senha inv\u00E1lido!
user.not.found.with.the.id=N\u00E3o foi encontrado o usu\u00E1rio com o ID
user.email.exist=J\u00E1 existe um usu\u00E1rio com o email
user.error.creating=Ocorreu um erro ao criar o usu\u00E1rio!
user.error.updating.id.not.found=Ocorreu um erro ao atualizar, ID do usu\u00E1rio n\u00E3o encontrado!
user.error.updating.with.the.id=Ocorreu um erro ao atualizar o usu\u00E1rio com o ID
use.not.found=Usu\u00E1rio não encontrado!

# Category
category.error.listing=Ocorreu um erro ao listar as categorias!
category.error.search=Ocorreu um erro ao buscar a categoria com ID
category.video.by.id=Ocorreu um erro ao buscar categoria v\u00EDde com ID
category.not.found.data=N\u00E3o foi encontrado dados de categorias!
category.not.found=Categoria n\u00E3o encontrada!
category.error.creating=Ocorreu um erro ao criar a categoria!
category.error.updating.id.not.found=Ocorreu um erro ao atualizar, ID da categoria n\u00E3o encontrado!
category.error.updating.with.the.id=Ocorreu um erro ao atualizar a categoria com o ID
category.error.deleting.id.not.found=Ocorreu um erro ao deletar, ID da categoria n\u00E3o encontrado!
category.error.deleting.with.the.id=Ocorreu um erro ao deletar a categoria com o ID
category.cannot.removed=A categoria não pode ser removida, está relacionada com um ou mais vídeos!
category.title.free.not.exist=N\u00E3o existe categoria cadastrada no banco de dados.A primeira categoria deve ser cadastrada com o t\u00EDtulo conforme o exemplo LIVRE.
category.title.exist=J\u00E1 existe a categoria com o t\u00EDtulo
category.deleting.success=Categoria deletada com sucesso.

# Video
video.error.listing=Ocorreu um erro ao listar os v\u00EDdeos!
video.error.search=Ocorreu um erro ao buscar o v\u00EDdeo com ID
video.not.found.search==N\u00E3o foi encontrado o v\u00EDdeo com o t\u00EDtulo
video.not.found.data=N\u00E3o foi encontrado dados de v\u00EDdeo!
video.not.found.with.the.id=N\u00E3o foi encontrado o v\u00EDdeo com o ID
video.error.creating=Ocorreu um erro ao criar o v\u00EDdeo!
video.error.updating.id.not.found=Ocorreu um erro ao atualizar, ID do v\u00EDdeo n\u00E3o encontrado!
video.error.updating.with.the.id=Ocorreu um erro ao atualizar o v\u00EDdeo com o ID
video.error.deleting.id.not.found=Ocorreu um erro ao deletar, ID do v\u00EDdeo n\u00E3o encontrado!
video.error.deleting.with.the.id=Ocorreu um erro ao deletar o v\u00EDdeo com o ID
video.title.exist=J\u00E1 existe o v\u00EDdeo com o t\u00EDtulo
video.deleting.success=V\u00EDdeo removido com sucesso.

integrity.violation=Integrity violation
